import sqlite3

conn = sqlite3.connect("database/school.db")

cursor = conn.cursor()

cursor.execute("""

INSERT INTO news
(title, description)

VALUES
(
'ग्रीष्मकालीन अवकाश सूचना',
'विद्यालय 15 जून तक अवकाश रहेगा।'
),
(
'कक्षा 10 और 12 के लिए अतिरिक्त कक्षाएं',
'बोर्ड परीक्षा की तैयारी हेतु सोमवार से अतिरिक्त कक्षाएं प्रारम्भ होंगी।'
),
(
'विज्ञान प्रदर्शनी का आयोजन',
'अगले सप्ताह विद्यालय प्रांगण में एक भव्य विज्ञान प्रदर्शनी का आयोजन किया जाएगा।'
),
(
'खेलकूद प्रतियोगिता के परिणाम',
'वार्षिक खेलकूद प्रतियोगिता के विजेताओं को कल प्रार्थना सभा में पुरस्कृत किया जाएगा।'
),
(
'शैक्षणिक सत्र 2026-27 के लिए प्रवेश प्रारम्भ',
'सभी कक्षाओं में प्रवेश प्रक्रिया प्रारंभ हो चुकी है। कृपया कार्यालय से संपर्क करें।'
),
(
'प्री-बोर्ड परीक्षा की समय सारिणी',
'कक्षा 10 एवं 12 की प्री-बोर्ड परीक्षा की समय सारिणी (Time Table) वेबसाइट पर उपलब्ध है।'
),
(
'विज्ञान प्रदर्शनी पंजीकरण',
'विज्ञान प्रदर्शनी (Science Exhibition) के लिए पंजीकरण की अंतिम तिथि 30 जून है।'
),
(
'विद्यालय गणवेश दिशानिर्देश',
'विद्यालय गणवेश (School Uniform) के संबंध में नए दिशानिर्देश जारी किए गए हैं। कृपया इनका कड़ाई से पालन करें।'
),
(
'खेल सप्ताह का आयोजन',
'खेल सप्ताह (Sports Week) का आयोजन अगले महीने किया जाएगा, इच्छुक विद्यार्थी अपने नाम पी.टी. शिक्षक के पास दर्ज कराएं।'
)

""")

conn.commit()

conn.close()

print("News Added")